Vimalananth/STM32-EC200-Firmware/src/ota.c
static void ota_send_close_file(void)
{
    char cmd[32];
    if (!ota_have_file_handle())
        return;
    snprintf(cmd, sizeof(cmd), "AT+QFCLOSE=%d", ota_file_handle);
    ota_send(cmd);
}

/* ── Flash write helpers ─────────────────────────────────────────────────── */
static bool flash_erase_page(uint32_t addr)
{
    FLASH_EraseInitTypeDef er = {
        .TypeErase = FLASH_TYPEERASE_PAGES,
        .Banks     = FLASH_BANK_1,
        .Page      = (addr - FLASH_BASE) / OTA_PAGE_SIZE,
        .NbPages   = 1
    };
    uint32_t err;
    HAL_IWDG_Refresh(&hiwdg);
    HAL_StatusTypeDef r = HAL_FLASHEx_Erase(&er, &err);
    HAL_IWDG_Refresh(&hiwdg);
    return (r == HAL_OK && err == 0xFFFFFFFFUL);
}

/* Write up to 256 bytes from buf to flash at addr (must be 8-byte aligned).
 * Returns true on success.                                                   */
static bool flash_write_chunk(uint32_t addr, const uint8_t *buf, uint32_t len)
{
    HAL_FLASH_Unlock();
    for (uint32_t i = 0; i + 8 <= len; i += 8) {
        uint64_t dw;
        memcpy(&dw, buf + i, 8);
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr + i, dw) != HAL_OK) {
            HAL_FLASH_Lock();
            return false;
        }
    }
    /* Handle remainder (pad with 0xFF) */
    uint32_t rem_start = len & ~7U;
    if (rem_start < len) {
        uint8_t pad[8];
        memset(pad, 0xFF, 8);
        memcpy(pad, buf + rem_start, len - rem_start);
        uint64_t dw;
        memcpy(&dw, pad, 8);
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr + rem_start, dw) != HAL_OK) {
            HAL_FLASH_Lock();
            return false;
        }
    }
    HAL_FLASH_Lock();
    return true;
}

/* ── Public API ──────────────────────────────────────────────────────────── */

void OTA_Init(void)     { ota_state = OTA_ST_IDLE; }
bool OTA_IsActive(void) { return ota_state != OTA_ST_IDLE && ota_state != OTA_ST_ERROR; }
bool OTA_BinaryPending(void) { return ota_bin_expect > 0; }

void OTA_SetSendFn(OTA_SendFn fn)       { ota_send_fn    = fn; }
void OTA_SetPublishFn(OTA_PublishFn fn) { ota_publish_fn = fn; }

void OTA_SetBinaryExpect(uint32_t n)
{
    ota_bin_pos    = 0;
    ota_bin_expect = (n <= OTA_CHUNK_SIZE) ? n : OTA_CHUNK_SIZE;
    ota_enter(OTA_ST_CHUNK_BINARY, OTA_READ_TIMEOUT_MS);
}

void OTA_FeedByte(uint8_t b)
{
    if (ota_bin_expect == 0) return;
    if (ota_bin_pos < OTA_CHUNK_SIZE)
        ota_bin_buf[ota_bin_pos++] = b;
    ota_bin_expect--;
    if (ota_bin_expect == 0)
        ota_enter(OTA_ST_CHUNK_FLASH, 0);  /* chunk complete → flash it */
}

void OTA_Start(const char *url)
{
    if (OTA_IsActive()) return;   /* don't interrupt an active download */

    strncpy(ota_url, url, sizeof(ota_url) - 1);
    ota_url[sizeof(ota_url) - 1] = '\0';
    ota_file_size    = 0;
    ota_offset       = 0;
    ota_crc32        = 0xFFFFFFFFUL;
    ota_last_progress= 0;
    ota_bin_expect   = 0;
    ota_bin_pos      = 0;
    ota_file_handle  = -1;
    qfopen_sent      = false;
    qfopen_attempts  = 0;
    qfopen_last_try_ms = 0;

    ota_publish("{\"ota_status\":\"starting\"}");

    /* Enable SSL if URL is HTTPS */
    if (strncmp(ota_url, "https://", 8) == 0) {
        Debug_Print("[OTA] Enabling HTTPS with insecure config\r\n");
        ota_send("AT+QHTTPCFG=\"ssl\",1");
        ota_enter(OTA_ST_SSL_ENABLE, OTA_SSL_STEP_TIMEOUT_MS);
    } else {
        /* No SSL — go straight to URL */
        char cmd[32];
        snprintf(cmd, sizeof(cmd), "AT+QHTTPURL=%d,30", (int)strlen(ota_url));
        ota_send(cmd);
        ota_enter(OTA_ST_HTTP_URL_CMD, 10000);
    }
}

void OTA_StartFromGet(const char *url)
{
    if (OTA_IsActive()) return;

    strncpy(ota_url, url, sizeof(ota_url) - 1);
    ota_url[sizeof(ota_url) - 1] = '\0';
    ota_file_size     = 0;
    ota_offset        = 0;
    ota_crc32         = 0xFFFFFFFFUL;
    ota_last_progress = 0;
    ota_bin_expect    = 0;
    ota_bin_pos       = 0;
    ota_file_handle   = -1;
    qfopen_sent       = false;
    qfopen_attempts   = 0;
    qfopen_last_try_ms = 0;

    /* Publish a "http_get" status so the error message saved in modem.c's
     * ota_error_msg shows we reached this stage.  This survives MQTT reconnect
     * and will be overwritten by the real error/success when OTA completes.  */
    ota_publish("{\"ota_status\":\"http_get\"}");

    /* URL already accepted by modem — go straight to HTTP GET.
     * Give the modem a timeout 10 s shorter than the firmware state-machine
     * timeout.  This guarantees the modem generates +QHTTPGET URC before
     * OTA_Process fires ota_error(), so we never race AT+QHTTPSTOP against
     * a still-running GET (which leaves the modem in an unresponsive state). */
    char cmd[32];
    snprintf(cmd, sizeof(cmd), "AT+QHTTPGET=%lu",
             (unsigned long)((OTA_CMD_TIMEOUT_MS - 10000UL) / 1000UL));
    ota_send(cmd);
    ota_enter(OTA_ST_HTTP_GET, OTA_CMD_TIMEOUT_MS);
}

void OTA_HandleLine(const char *line)
{
    char dbg[128];
    snprintf(dbg, sizeof(dbg), "[OTA] Received: %s\r\n", line);
    Debug_Print(dbg);

    // Publish received line for MQTT logging
    char recv_msg[256];
    snprintf(recv_msg, sizeof(recv_msg), "{\"ota_debug\":\"Received: %s\"}", line);
    ota_publish(recv_msg);

    /* If the modem reboots while OTA is running, HTTP session state is lost.
     * Abort immediately so modem.c can run a full modem re-init path. */
    if (strstr(line, "RDY") || strstr(line, "+CFUN: 1")) {
        ota_error("modem rebooted during ota");
        return;
    }

    /* Lines that matter in each state */
    switch (ota_state) {

    case OTA_ST_SSL_ENABLE:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"seclevel\",1,1");  // seclevel=1 to require CA verification
            ota_enter(OTA_ST_SSL_SECLEVEL, OTA_SSL_STEP_TIMEOUT_MS);
            ota_publish("{\"ota_debug\":\"SSL enable OK\"}");
        } else if (strstr(line, "ERROR")) ota_error("SSL enable failed");
        break;

    case OTA_ST_SSL_SECLEVEL:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"cacert\",1,\"cacert.pem\"");  // Reference uploaded CA cert
            ota_enter(OTA_ST_SSL_CACERT, OTA_SSL_STEP_TIMEOUT_MS);
            ota_publish("{\"ota_debug\":\"SSL seclevel OK\"}");
        } else if (strstr(line, "ERROR")) ota_error("SSL seclevel failed");
        break;

    case OTA_ST_SSL_CACERT:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"sslversion\",1,4");
            ota_enter(OTA_ST_SSL_VERSION, OTA_SSL_STEP_TIMEOUT_MS);
            ota_publish("{\"ota_debug\":\"SSL cacert OK\"}");
        } else if (strstr(line, "ERROR")) ota_error("SSL cacert failed");
        break;

    case OTA_ST_SSL_VERSION:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
            ota_enter(OTA_ST_SSL_CIPHER, OTA_SSL_STEP_TIMEOUT_MS);
            ota_publish("{\"ota_debug\":\"SSL version OK\"}");
        } else if (strstr(line, "ERROR")) ota_error("SSL version failed");
        break;

    case OTA_ST_SSL_CIPHER:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QHTTPCFG=\"sslctxid\",1");
            ota_enter(OTA_ST_SSL_CTXID, OTA_SSL_STEP_TIMEOUT_MS);
            ota_publish("{\"ota_debug\":\"SSL cipher OK\"}");
        } else if (strstr(line, "ERROR")) ota_error("SSL cipher failed");
        break;

    case OTA_ST_SSL_CTXID:
        if (strcmp(line, "OK") == 0) {
            /* Config done — now set URL */
            char cmd[32];
            snprintf(cmd, sizeof(cmd), "AT+QHTTPURL=%d,30", (int)strlen(ota_url));
            ota_send(cmd);
            ota_enter(OTA_ST_HTTP_URL_CMD, 10000);
            ota_publish("{\"ota_debug\":\"SSL ctxid OK\"}");
        } else if (strstr(line, "ERROR")) ota_error("SSL ctxid failed");
        break;

