Vimalananth/STM32-EC200-Firmware/src/ota.c
    case OTA_ST_HTTP_URL_CMD:
        if (strstr(line, "CONNECT")) {
            /* modem is ready for URL text — send it now */
            if (ota_send_fn) ota_send_fn(ota_url);  /* no \r\n — modem ends on OK */
            ota_enter(OTA_ST_HTTP_URL_BODY, 10000);
            ota_publish("{\"ota_debug\":\"HTTP URL CONNECT\"}");
        }
        if (strstr(line, "ERROR")) ota_error("QHTTPURL cmd failed");
        break;

    case OTA_ST_HTTP_URL_BODY:
        if (strcmp(line, "OK") == 0) {
            /* URL accepted, now start download */
            char cmd[32];
            snprintf(cmd, sizeof(cmd), "AT+QHTTPGET=%lu", (unsigned long)(OTA_CMD_TIMEOUT_MS / 1000));
            ota_send(cmd);
            ota_enter(OTA_ST_HTTP_GET, OTA_CMD_TIMEOUT_MS);
            ota_publish("{\"ota_status\":\"downloading\"}");
        }
        if (strstr(line, "ERROR")) ota_error("QHTTPURL body failed");
        break;

    case OTA_ST_HTTP_GET:
        if (strstr(line, "+QHTTPGET:")) {
            /* Format A: +QHTTPGET: 0,<http_code>,<content_length>
             * Format B: +QHTTPGET: 0,0,<http_code>,<content_length>  (some FW versions)
             * Skip commas until we find http_code == 200 or 206. */
            const char *p = strchr(line, ',');
            if (!p) { ota_error("QHTTPGET bad response"); break; }
            int http_code = 0;
            while (p) {
                http_code = atoi(p + 1);
                if (http_code == 200 || http_code == 206) break;
                p = strchr(p + 1, ',');
            }
            if (http_code != 200 && http_code != 206) {
                ota_error("HTTP not 200");
                break;
            }
            p = strchr(p + 1, ',');
            if (p) ota_file_size = (uint32_t)atoi(p + 1);
            if (ota_file_size == 0 || ota_file_size > OTA_SLOT_SIZE) {
                ota_error("bad file size");
                break;
            }
            {
                char msg[64];
                snprintf(msg, sizeof(msg), "{\"ota_status\":\"flashing\",\"total\":%lu}",
                         (unsigned long)ota_file_size);
                ota_publish(msg);
            }
            /* AT+QHTTPGET fills the modem's internal RAM buffer only.
             * AT+QHTTPREADFILE transfers that buffer → UFS file "HTTP_GETFILE"
             * so AT+QFOPEN can read it back in chunks.                        */
            {
                char cmd[64];
                snprintf(cmd, sizeof(cmd), "AT+QHTTPREADFILE=\"%s\",80", OTA_HTTP_FILE);
                ota_send(cmd);
                ota_enter(OTA_ST_HTTP_READFILE, OTA_CMD_TIMEOUT_MS);
            }
        }
        if (strstr(line, "ERROR")) ota_error("QHTTPGET failed");
        break;

    case OTA_ST_HTTP_READFILE:
        if (strstr(line, "+QHTTPREADFILE:")) {
            const char *p = strchr(line, ':');
            int err = p ? atoi(p + 1) : -1;
            if (err != 0) {
                ota_error("QHTTPREADFILE failed");
                break;
            }
            /* AT+QHTTPSTOP MUST be sent before AT+QFOPEN.
             * The modem holds the HTTP session open after QHTTPREADFILE
             * and silently ignores QFOPEN while that session is active.
             * OTA_Process sends QFOPEN after a 2 s settle (which gives
             * the QHTTPSTOP OK time to arrive and be ignored).          */
            ota_send("AT+QHTTPSTOP");
            qfopen_sent = false;
            qfopen_attempts = 0;
            qfopen_last_try_ms = 0;
            ota_enter(OTA_ST_FILE_OPEN, 45000);
        }
        if (strstr(line, "ERROR")) ota_error("QHTTPREADFILE failed");
        break;

    case OTA_ST_FILE_OPEN:
        if (strstr(line, "+QFOPEN:")) {
            const char *p = strchr(line, ':');
            ota_file_handle = p ? atoi(p + 1) : -1;
            if (ota_file_handle < 0) {
                ota_error("QFOPEN bad handle");
                break;
            }
            /* File open; send first read request */
            ota_send_read_chunk();
            ota_enter(OTA_ST_CHUNK_READ, OTA_READ_TIMEOUT_MS);
            ota_publish("{\"ota_debug\":\"File opened\"}");
        }
        if (strstr(line, "ERROR")) {
            if (qfopen_attempts >= OTA_QFOPEN_MAX_ATTEMPTS) {
                ota_error("QFOPEN failed");
            } else {
                qfopen_sent = false;
            }
        }
        break;

    case OTA_ST_CHUNK_READ:
        /* modem replies "CONNECT N\r\n" where N = actual bytes */
        if (strncmp(line, "CONNECT", 7) == 0) {
            uint32_t n = (uint32_t)atoi(line + 7);
            if (n == 0) { ota_error("QFREAD zero bytes"); break; }
            OTA_SetBinaryExpect(n);
            /* OTA_ST_CHUNK_BINARY entered by OTA_SetBinaryExpect() */
            char chunk_msg[64];
            snprintf(chunk_msg, sizeof(chunk_msg), "{\"ota_debug\":\"Chunk read: %lu bytes\"}", (unsigned long)n);
            ota_publish(chunk_msg);
        }
        if (strstr(line, "ERROR")) ota_error("QFREAD failed");
        break;

    case OTA_ST_FILE_CLOSE:
        /* After OK, write flags and reboot */
        if (strcmp(line, "OK") == 0)
            ota_enter(OTA_ST_FLAG_WRITE, 0);
        break;

    default:
        break;
    }
}

/* ── OTA_Process — called every main loop iteration ─────────────────────── */
void OTA_Process(void)
{
    /* Timeout check — applicable in most states */
    if (ota_state != OTA_ST_IDLE  &&
        ota_state != OTA_ST_ERROR &&
        ota_state != OTA_ST_CHUNK_FLASH &&
        ota_state != OTA_ST_FLAG_WRITE  &&
        ota_state != OTA_ST_REBOOT      &&
        ota_timeout_ms > 0)
    {
        if (HAL_GetTick() - ota_state_ms > ota_timeout_ms) {
            const char *why;
            switch (ota_state) {
                case OTA_ST_HTTP_URL_CMD:  why = "no CONNECT";  break;
                case OTA_ST_HTTP_URL_BODY: why = "no URL OK";   break;
                case OTA_ST_HTTP_GET:      why = "http get TO"; break;
                case OTA_ST_HTTP_READFILE: why = "readfile TO"; break;
                case OTA_ST_FILE_OPEN:     why = "fopen TO";    break;
                case OTA_ST_CHUNK_READ:    why = "chunk TO";    break;
                case OTA_ST_CHUNK_BINARY:  why = "binary TO";   break;
                case OTA_ST_FILE_CLOSE:    why = "fclose TO";   break;
                default:                   why = "timeout";     break;
            }
            char dbg[64];
            snprintf(dbg, sizeof(dbg), "[OTA] Timeout in state %d: %s\r\n", ota_state, why);
            Debug_Print(dbg);
            char timeout_msg[128];
            snprintf(timeout_msg, sizeof(timeout_msg), "{\"ota_debug\":\"Timeout in state %d: %s\"}", ota_state, why);
            ota_publish(timeout_msg);
            ota_error(why);
            return;
        }
    }

